# Ионин Василий Андреевич (вариант № 14)
# Лабораторная работа № 1

############## Подзадача 1 ##############
# Задать объём выборки N
N <- 1000

############## Подзадача 2 ##############
# Задать параметры соответствующего распределения

# Параметры смеси
p <- 0.2    # Коэффициент смешивания
p_1 <- 0.2
p_2 <- 1 - p_1

# Параметры для распределения Парето
a <- 4
x_0 <- 0.5  # Коэффициент масштаба

# Параметры для нормального распределения
l <- -1     # Левая граница интервала
r <- 1      # Правая граница интервала